## Import Necessary libraries

In [377]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

# load data

In [380]:
df=pd.read_csv("C:\\Users\\akhil\\Downloads\\loan (1).csv")

In [382]:
df.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [384]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [386]:
df.shape

(614, 13)

In [388]:
df.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [390]:
df.dtypes

Loan_ID               object
Gender                object
Married               object
Dependents            object
Education             object
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
Loan_Status           object
dtype: object

In [392]:
df.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [394]:
df_num=df.select_dtypes(include=[np.number])
df_cat=df.select_dtypes(include=['object'])

In [396]:
df_num.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [397]:
df_cat.describe(include='all')

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,Property_Area,Loan_Status
count,614,601,611,599,614,582,614,614
unique,614,2,2,4,2,2,3,2
top,LP001002,Male,Yes,0,Graduate,No,Semiurban,Y
freq,1,489,398,345,480,500,233,422

In [400]:
df_num.isnull().sum().sort_values(ascending=False)

Credit_History       50
LoanAmount           22
Loan_Amount_Term     14
ApplicantIncome       0
CoapplicantIncome     0
dtype: int64

In [401]:
df_cat.isnull().sum().sort_values(ascending=False)

Self_Employed    32
Dependents       15
Gender           13
Married           3
Loan_ID           0
Education         0
Property_Area     0
Loan_Status       0
dtype: int64

# Imputation of Numerical columns

In [424]:
for col in ["Credit_History","LoanAmount","Loan_Amount_Term"]:
    df_num[col].fillna(df_num[col].median(),inplace=True)

C:\Users\akhil\AppData\Local\Temp\ipykernel_13028\3111084037.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_num[col].fillna(df_num[col].median(),inplace=True)

In [426]:
df_num.isnull().sum().sort_values(ascending=False)

ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
dtype: int64

# Imputation for catgorical columns

In [429]:
for col in ["Self_Employed","Dependents","Gender","Married"]:
    df_cat[col].fillna(df_cat[col].value_counts().idxmax(),inplace=True)

C:\Users\akhil\AppData\Local\Temp\ipykernel_13028\159940024.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_cat[col].fillna(df_cat[col].value_counts().idxmax(),inplace=True)
C:\Users\akhil\AppData\Local\Temp\ipykernel_13028\159940024.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_cat[col].fillna(df_cat[col].value_counts().idxmax(),inplace=True)
C:\Users\akhil\AppData\Local\Temp\ipykernel_13028\159940024.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_cat[col].fillna(df_cat[col].value_counts().idxmax(),inplace=True)
C:\Users\akhil\AppData\Local\Temp\ipykernel_13028\159940024.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_cat[col].fillna(df_cat[col].value_counts().idxmax(),inplace=True)

In [431]:
df_cat.isnull().sum().sort_values(ascending=False)

Loan_ID          0
Gender           0
Married          0
Dependents       0
Education        0
Self_Employed    0
Property_Area    0
Loan_Status      0
dtype: int64

# Correlationship between numerical columns and numerical target

In [433]:
df_num_corr=df_num.corr()

In [438]:
df['Loan_Status'] = df['Loan_Status'].map({'Y': 1, 'N': 0})

In [440]:
df_num= df.select_dtypes(include=['int64', 'float64'])

In [442]:
correlation_matrix = df_num.corr()
print(correlation_matrix['Loan_Status'])

ApplicantIncome     -0.004710
CoapplicantIncome   -0.059187
LoanAmount          -0.037318
Loan_Amount_Term    -0.021268
Credit_History       0.561678
Loan_Status          1.000000
Name: Loan_Status, dtype: float64

# Correlationship between categorical columns and continous target variable using one way ANNOVA

In [447]:
from scipy.stats import f_oneway

In [449]:
df_cat['ls']=df_num['Loan_Status']

In [451]:
groups = [df_cat['ls'][df_cat['Married'] == category] for category in df_cat['Married'].unique()]

# Perform ANOVA
f_stat, p_value = f_oneway(*groups)
print(f"F-statistic: {f_stat}, P-value: {p_value}")

F-statistic: 5.164551722656315, P-value: 0.02339836279661985

In [455]:
#This will store the names of categorical columns that are significantly associated with 'sp'.
c_list=[]
#This will store the names of columns that are not significantly associated with 'sp'.
nc_list=[]
for c1 in list(df_cat.columns):
    if c1=='ls':
        continue
    else:
        groups=[df_cat['ls'][df_cat[c1] == category] for category in df_cat[c1].unique()]
        f_stat, p_value = f_oneway(*groups)
        print(f"column : {c1}, F-statistic: {f_stat}, P-value: {p_value}")
        if p_value < 0.05:
            c_list.append(c1)
        else:
            nc_list.append(c1)

column : Loan_ID, F-statistic: nan, P-value: nan
column : Gender, F-statistic: 0.19805868994529022, P-value: 0.656449758464281
column : Married, F-statistic: 5.164551722656315, P-value: 0.02339836279661985
column : Dependents, F-statistic: 1.0490070085062186, P-value: 0.3703188306348489
column : Education, F-statistic: 4.547684575841726, P-value: 0.03336067753728906
column : Self_Employed, F-statistic: 0.00838037719537718, P-value: 0.9270899835542965
column : Property_Area, F-statistic: 6.243824207425567, P-value: 0.002068617689238754
column : Loan_Status, F-statistic: inf, P-value: 0.0

C:\Users\akhil\anaconda3\Lib\site-packages\scipy\stats\_stats_py.py:4102: DegenerateDataWarning: all input arrays have length 1.  f_oneway requires that at least one input has length greater than 1.
  if _f_oneway_is_too_small(samples):
C:\Users\akhil\anaconda3\Lib\site-packages\scipy\stats\_axis_nan_policy.py:531: ConstantInputWarning: Each of the input arrays is constant; the F statistic is not defined or infinite
  res = hypotest_fun_out(*samples, **kwds)

In [457]:
c_list

['Married', 'Education', 'Property_Area', 'Loan_Status']

In [459]:
nc_list

['Loan_ID', 'Gender', 'Dependents', 'Self_Employed']

In [461]:
df_cat1=df_cat[c_list]

In [463]:
df_cat1.columns

Index(['Married', 'Education', 'Property_Area', 'Loan_Status'], dtype='object')

In [465]:
df_cat1.head()

  Married     Education Property_Area Loan_Status
0      No      Graduate         Urban           Y
1     Yes      Graduate         Rural           N
2     Yes      Graduate         Urban           Y
3     Yes  Not Graduate         Urban           Y
4      No      Graduate         Urban           Y

# LabelEncoding

In [468]:
from sklearn.preprocessing import LabelEncoder

In [470]:
le=LabelEncoder()

In [472]:
df_cat1_e=df_cat1.apply(le.fit_transform)

In [473]:
df_cat1_e.head()

   Married  Education  Property_Area  Loan_Status
0        0          0              2            1
1        1          0              0            0
2        1          0              2            1
3        1          1              2            1
4        0          0              2            1

In [476]:
df_cat1.shape

(614, 4)

# Onehot encoding method1

In [479]:
df_encoded = pd.get_dummies(df_cat1, columns=df_cat1.columns)

In [481]:
df_encoded.shape

(614, 9)

# method2

In [484]:
from sklearn.preprocessing import OneHotEncoder

In [486]:
encoder = OneHotEncoder(sparse_output=False, handle_unknown='ignore')

In [488]:
encoded_array = encoder.fit_transform(df_cat1)

encoded_df = pd.DataFrame(encoded_array, columns=encoder.get_feature_names_out(df_cat1.columns))

In [490]:
encoded_df.shape

(614, 9)

# Outlier treatment IQR

In [493]:
def remove_outliers_iqr(df, columns):
    for col in columns:
        Q1 = df[col].quantile(0.25)  # First quartile (25th percentile)
        Q3 = df[col].quantile(0.75)  # Third quartile (75th percentile)
        IQR = Q3 - Q1               # Interquartile range
        lower_bound = Q1 - 1.5 * IQR  # Lower bound
        upper_bound = Q3 + 1.5 * IQR  # Upper bound

        # Remove outliers
        df = df[(df[col] >= lower_bound) & (df[col] <= upper_bound)]
    
    return df

In [497]:
columns_to_check = ['Credit_History','Loan_Status']    

df_no_outliers = remove_outliers_iqr(df_num, columns_to_check)

print("Original DataFrame:")
print(df_num.shape)
print("\nDataFrame after Outlier Treatment:")
print(df_no_outliers.shape)

Original DataFrame:
(614, 6)

DataFrame after Outlier Treatment:
(378, 6)

In [499]:
encoded_df.shape

(614, 9)

In [501]:
df_no_outliers.shape

(378, 6)

In [503]:
df_f_cat=encoded_df.loc[df_no_outliers.index,:]

# MinMaxScaler scales features to a fixed range, typically [0,1](but can be customized).

In [506]:
from sklearn.preprocessing import MinMaxScaler, StandardScaler

In [508]:
columns_to_scale =['Row ID','Postal Code','Sales','Quantity','Discount','Profit','Shipping Cost']

In [360]:
minmax_scaler = MinMaxScaler()
df_minmax_scaled = df_no_outliers.copy()
df_minmax_scaled[columns_to_scale] = minmax_scaler.fit_transform(df_no_outliers[columns_to_scale])

In [362]:
df_minmax_scaled.head()

,Row ID,Postal Code,Sales,Quantity,Discount,Profit,Shipping Cost
11866,0.183782,0.0,0.293173,0.000000,0.000000,0.735673,1.000000
11867,0.239934,0.0,0.429314,0.166667,0.000000,0.649534,1.000000
11868,0.569654,0.0,0.668531,0.333333,0.000000,0.516834,1.000000
11870,0.036246,0.0,0.295245,0.000000,0.003322,0.609120,1.000000
11871,0.407534,0.0,0.220067,0.333333,0.166113,0.426737,0.999629

# It transforms the data so that it has a mean of 0 and a standard deviation of 1.

In [365]:
standard_scaler = StandardScaler()
df_standard_scaled = df_no_outliers.copy()
df_standard_scaled[columns_to_scale] = standard_scaler.fit_transform(df_no_outliers[columns_to_scale])

In [367]:
df_standard_scaled.head()

,Row ID,Postal Code,Sales,Quantity,Discount,Profit,Shipping Cost
11866,-0.861868,0.0,1.372561,-1.092202,-0.603113,1.589405,3.269680
11867,-0.677319,0.0,2.474973,-0.462813,-0.603113,1.082556,3.269680
11868,0.406329,0.0,4.412057,0.166576,-0.603113,0.301735,3.269680
11870,-1.346757,0.0,1.389333,-1.092202,-0.592365,0.844755,3.269680
11871,-0.126492,0.0,0.780579,0.166576,-0.065700,-0.228401,3.268062

In [369]:
final_df=pd.concat([df_standard_scaled,df_f_cat],axis=1)

In [370]:
final_df.shape

(25882, 21898)

In [373]:
final_df.columns

Index(['Row ID', 'Postal Code', 'Sales', 'Quantity', 'Discount', 'Profit',
       'Shipping Cost', 'Order Date_01-01-2011', 'Order Date_01-01-2013',
       'Order Date_01-01-2014',
       ...
       'Product Name_Zebra ZM400 Thermal Label Printer',
       'Product Name_Zebra Zazzle Fluorescent Highlighters',
       'Product Name_Zipper Ring Binder Pockets',
       'Product Name_i.Sound Portable Power - 8000 mAh',
       'Product Name_iHome FM Clock Radio with Lightning Dock',
       'Product Name_iKross Bluetooth Portable Keyboard + Cell Phone Stand Holder + Brush for Apple iPhone 5S 5C 5, 4S 4',
       'Product Name_iOttie HLCRIO102 Car Mount',
       'Product Name_iOttie XL Car Mount',
       'Product Name_invisibleSHIELD by ZAGG Smudge-Free Screen Protector',
       'Product Name_netTALK DUO VoIP Telephone Service'],
      dtype='object', length=21898)